# YOLOv8n-seg-temporal 配置
# 用于内窥镜图像分割任务，包含时序记忆模块

# 任务参数
task: segment  # 分割任务
mode: train    # 训练模式

# 模型参数
nc: 1  # 类别数量（根据实际任务调整）
scale: n  # 模型规模
depth_multiple: 0.33  # 深度缩放因子
width_multiple: 0.25  # 宽度缩放因子
max_channels: 1024    # 最大通道数

# 骨干网络
backbone:
  # [from, number, module, args]
  - [-1, 1, Conv, [64, 3, 2]]  # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]  # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]]  # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]]  # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]  # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]  # 9

# 头部网络
head:
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 6], 1, Concat, [1]]  # cat backbone P4
  - [-1, 3, C2f, [512]]  # 12
  
  - [-1, 1, nn.Upsample, [None, 2, 'nearest']]
  - [[-1, 4], 1, Concat, [1]]  # cat backbone P3
  - [-1, 3, C2f, [256]]  # 15
  
  # 添加时序记忆模块
  - [-1, 1, TemporalMemoryBlock, [256, 256, 3]]  # 16
  
  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]]  # cat head P4
  - [-1, 3, C2f, [512]]  # 19
  
  # 添加时序记忆模块
  - [-1, 1, TemporalMemoryBlock, [512, 512, 3]]  # 20
  
  - [-1, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]]  # cat head P5
  - [-1, 3, C2f, [1024]]  # 23
  
  # 添加时序记忆模块
  - [-1, 1, TemporalMemoryBlock, [1024, 1024, 3]]  # 24
  
  # 分割头
  - [[15, 20, 24], 1, Segment, [1, 32, 256, [256, 512, 1024]]]  # Segment(P3, P4, P5)

# 训练参数
args:
  epochs: 100
  batch: 16
  imgsz: 640
  device: 0
  workers: 8
  optimizer: SGD
  lr0: 0.01
  lrf: 0.01
  momentum: 0.937
  weight_decay: 0.0005
  warmup_epochs: 3.0
  warmup_momentum: 0.8
  warmup_bias_lr: 0.1
  box: 7.5
  cls: 0.5
  dfl: 1.5
  pose: 12.0
  kobj: 1.0
  label_smoothing: 0.0
  nbs: 64
  overlap_mask: true
  mask_ratio: 4
  dropout: 0.0
  val: true 